"""Создайте новый проект в интегрированной среде разработки PyCharm. Создайте файл исходного кода и напишите программу,
которая выводит ваше имя. Запустите его. Создайте второй файл с кодом и напишите программу, которая спрашивает у
пользователя, как его зовут, и здоровается с ним. Запустите его. Переключитесь на первый скрипт и запустите его.
Переключитесь обратно на второй скрипт.
"""

yourname = 'Dima'


def func():
    yourname


if __name__ == '__main__':
    print(yourname)

input('Press any button')
