"""Создайте новый проект в интегрированной среде разработки PyCharm. Создайте файл исходного кода и напишите программу,
которая выводит ваше имя. Запустите его. Создайте второй файл с кодом и напишите программу, которая спрашивает у
пользователя, как его зовут, и здоровается с ним. Запустите его. Переключитесь на первый скрипт и запустите его.
Переключитесь обратно на второй скрипт.
"""

import HW_1_4_1

name1 = input('What is your name? ')
print('Hello, ', name1)

print('My name is ', HW_1_4_1.yourname)

input('Press any button')
