"""Напишите программу, которая спрашивает у пользователя два слова и выводит их разделёнными запятой."""

x = input('Input first word: ')
y = input('Input second word: ')
print(x, y, sep=', ')
input('Press any key')
