"""Напишите программу, которая запрашивает три целых числа a, b и x и выводит True, если x лежит между a и b,
иначе – False.
"""

a = int(input('Enter a number "a": '))
b = int(input('Enter a number "b": '))
x = int(input('Enter a number "x": '))
print(a < x < b)
input('Press any key')
