"""Реализуйте цикл, который будет перебирать все значения итерабельного объекта iterable."""

iterable = ['Some', 'iterable', 'object', 'for', 'test']

for x in iterable:
    print(x)
