"""Создайте список и введите его значения. Найдите наибольший и наименьший элемент списка, а также сумму и среднее
арифметическое его значений.
"""

l1 = [6, 3, 8, 1, 7]
print('Max value:', max(l1))
print('Min value:', min(l1))
print('Sum all elements: ', sum(l1))
print('Arithmetic mean:', sum(l1)/len(l1))
